MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F146J8/mcu.h
typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    __IO uint8_t P42                        : 1;
    __IO uint8_t P43                        : 1;
    __IO uint8_t P44                        : 1;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_set4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
} stc_gpio_set5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
} stc_gpio_set6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
    __IO uint8_t P75                        : 1;
} stc_gpio_set7_field_t;

typedef struct
{
    __IO uint32_t ADE00                     : 1;
    __IO uint32_t ADE01                     : 1;
    __IO uint32_t ADE02                     : 1;
    __IO uint32_t ADE03                     : 1;
    __IO uint32_t ADE04                     : 1;
    __IO uint32_t ADE05                     : 1;
    __IO uint32_t ADE06                     : 1;
    __IO uint32_t ADE07                     : 1;
    __IO uint32_t ADE08                     : 1;
    __IO uint32_t ADE09                     : 1;
    __IO uint32_t ADE10                     : 1;
    __IO uint32_t ADE11                     : 1;
    __IO uint32_t ADE12                     : 1;
    __IO uint32_t ADE13                     : 1;
    __IO uint32_t ADE14                     : 1;
    __IO uint32_t ADE15                     : 1;
    __IO uint32_t ADE16                     : 1;
    __IO uint32_t ADE17                     : 1;
    __IO uint32_t ADE18                     : 1;
    __IO uint32_t ADE19                     : 1;
    __IO uint32_t ADE20                     : 1;
    __IO uint32_t ADE21                     : 1;
    __IO uint32_t ADE22                     : 1;
    __IO uint32_t ADE23                     : 1;
} stc_gpio_analog_field_t;

typedef struct
{
    __IO uint8_t SUBCS                      : 2;
    __IO uint8_t MAINCS                     : 2;
} stc_gpio_sps_field_t;

typedef struct
{
    __IO uint32_t NMIS                      : 1;
    __IO uint32_t CROUTE                    : 2;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t SWDEN                     : 1;
} stc_gpio_fn_sel00_field_t;

typedef struct
{
    __IO uint32_t PWM00E                    : 2;
    __IO uint32_t PWM01E                    : 2;
    __IO uint32_t PWM02E                    : 2;
    __IO uint32_t PWM03E                    : 2;
    __IO uint32_t PWM04E                    : 2;
    __IO uint32_t PWM05E                    : 2;
    __IO uint32_t EMII0C                    : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t EMII0S                    : 1;
    uint32_t RESERVED17                     : 1;
    __IO uint32_t EXCK0S                    : 1;
} stc_gpio_fn_sel01_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t TIOA0E                    : 2;
    __IO uint32_t TIOB0S                    : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t TIOA1S                    : 2;
    __IO uint32_t TIOA1E                    : 2;
    __IO uint32_t TIOB1S                    : 2;
    uint32_t RESERVED14                     : 4;
    __IO uint32_t TIOA2E                    : 2;
    __IO uint32_t TIOB2S                    : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t TIOA3S                    : 2;
    __IO uint32_t TIOA3E                    : 2;
    __IO uint32_t TIOB3S                    : 2;
} stc_gpio_fn_sel02_field_t;

typedef struct
{
    __IO uint32_t EINT00S                   : 2;
    __IO uint32_t EINT01S                   : 2;
    __IO uint32_t EINT02S                   : 2;
    __IO uint32_t EINT03S                   : 2;
    __IO uint32_t EINT04S                   : 2;
    __IO uint32_t EINT05S                   : 2;
    __IO uint32_t EINT06S                   : 2;
    __IO uint32_t EINT07S                   : 2;
    __IO uint32_t EINT08S                   : 2;
    __IO uint32_t EINT09S                   : 2;
    __IO uint32_t EINT10S                   : 2;
    __IO uint32_t EINT11S                   : 2;
    __IO uint32_t EINT12S                   : 2;
    __IO uint32_t EINT13S                   : 2;
    __IO uint32_t EINT14S                   : 2;
    __IO uint32_t EINT15S                   : 2;
} stc_gpio_fn_sel04_field_t;

typedef struct
{
    __IO uint32_t RTS4E                     : 2;
    __IO uint32_t CTS4S                     : 2;
    __IO uint32_t SIN4S                     : 2;
    __IO uint32_t SOT4B                     : 2;
    __IO uint32_t SCK4B                     : 2;
    __IO uint32_t SCS40B                    : 2;
    __IO uint32_t SCS41E                    : 2;
    uint32_t RESERVED14                     : 6;
    __IO uint32_t SIN5S                     : 2;
    __IO uint32_t SOT5B                     : 2;
    __IO uint32_t SCK5B                     : 2;
    __IO uint32_t SCS50B                    : 2;
} stc_gpio_fn_sel07_field_t;

typedef struct
{
    __IO uint32_t RTS6E                     : 2;
    __IO uint32_t CTS6S                     : 2;
    __IO uint32_t SIN6S                     : 2;
    __IO uint32_t SOT6B                     : 2;
    __IO uint32_t SCK6B                     : 2;
    __IO uint32_t SCS60B                    : 2;
    __IO uint32_t SCS61E                    : 2;
    __IO uint32_t SCS62E                    : 2;
} stc_gpio_fn_sel08_field_t;

typedef struct
{
    __IO uint32_t VCOE                      : 2;
    uint32_t RESERVED2                      :22;
    __IO uint32_t ADTGS                     : 1;
} stc_gpio_fn_sel09_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 3;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_odr0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
} stc_gpio_odr1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
} stc_gpio_odr2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    __IO uint8_t P32                        : 1;
} stc_gpio_odr3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    __IO uint8_t P42                        : 1;
    __IO uint8_t P43                        : 1;
    __IO uint8_t P44                        : 1;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_odr4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
} stc_gpio_odr5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
} stc_gpio_odr6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
    __IO uint8_t P75                        : 1;
} stc_gpio_odr7_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 3;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_fsete0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
} stc_gpio_fsete1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
} stc_gpio_fsete2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    __IO uint8_t P32                        : 1;
} stc_gpio_fsete3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    __IO uint8_t P42                        : 1;
    __IO uint8_t P43                        : 1;
    __IO uint8_t P44                        : 1;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_fsete4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
} stc_gpio_fsete5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
} stc_gpio_fsete6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
    __IO uint8_t P75                        : 1;
} stc_gpio_fsete7_field_t;

typedef struct
{
    __IO uint8_t IE                         : 1;
    __IO uint8_t RSTEN                      : 1;
} stc_hwwdt_wdt_ctl_field_t;

typedef struct
{
    __IO uint8_t STA                        : 1;
} stc_hwwdt_wdt_sta_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 5;
    __IO uint32_t AD0IS                     : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t CT0IS                     : 1;
    __IO uint32_t CT2IS                     : 1;
    uint32_t RESERVED10                     :10;
    __IO uint32_t MSC4RXIS                  : 1;
    __IO uint32_t MSC4TXIS                  : 1;
    __IO uint32_t MSC5RXIS                  : 1;
    __IO uint32_t MSC5TXIS                  : 1;
    __IO uint32_t MSC6RXIS                  : 1;
    __IO uint32_t MSC6TXIS                  : 1;
    uint32_t RESERVED26                     : 2;
    __IO uint32_t E0IS                      : 1;
    __IO uint32_t E1IS                      : 1;
    __IO uint32_t E2IS                      : 1;
    __IO uint32_t E3IS                      : 1;
} stc_irqc_irq_dsel_field_t;

typedef struct
{
    __IO uint32_t NMI                       : 1;
    __IO uint32_t HWWDG                     : 1;
} stc_irqc_irq_st02_field_t;

typedef struct
{
    __IO uint32_t AFDI                      : 1;
} stc_irqc_irq00pend_field_t;

typedef struct
{
    __IO uint32_t SWWDG                     : 1;
} stc_irqc_irq01pend_field_t;

typedef struct
{
    __IO uint32_t LVD                       : 1;
} stc_irqc_irq02pend_field_t;

typedef struct
{
    __IO uint32_t MEMIF                     : 1;
    __IO uint32_t WOU10                     : 1;
    __IO uint32_t WOU32                     : 1;
    __IO uint32_t WOU54                     : 1;
} stc_irqc_irq03pend_field_t;

typedef struct
{
    __IO uint32_t EXTI0                     : 1;
    __IO uint32_t EXTI1                     : 1;
    __IO uint32_t EXTI2                     : 1;
    __IO uint32_t EXTI3                     : 1;
    __IO uint32_t EXTI4                     : 1;
    __IO uint32_t EXTI5                     : 1;
    __IO uint32_t EXTI6                     : 1;
    __IO uint32_t EXTI7                     : 1;
} stc_irqc_irq04pend_field_t;

typedef struct
{
    __IO uint32_t EXTI8                     : 1;
    __IO uint32_t EXTI9                     : 1;
    __IO uint32_t EXTI10                    : 1;
    __IO uint32_t EXTI11                    : 1;
    __IO uint32_t EXTI12                    : 1;
    __IO uint32_t EXTI13                    : 1;
    __IO uint32_t EXTI14                    : 1;
    __IO uint32_t EXTI15                    : 1;
} stc_irqc_irq05pend_field_t;

typedef struct
{
    __IO uint32_t DT1                       : 2;
} stc_irqc_irq06pend_field_t;

typedef struct
{
    __IO uint32_t MSC4INT                   : 1;
} stc_irqc_irq15pend_field_t;

typedef struct
{
    __IO uint32_t MSC4INT                   : 2;
} stc_irqc_irq16pend_field_t;

typedef struct
{
    __IO uint32_t MSC5NT                    : 1;
} stc_irqc_irq17pend_field_t;

typedef struct
{
    __IO uint32_t MSC5INT                   : 2;
} stc_irqc_irq18pend_field_t;

typedef struct
{
    __IO uint32_t MSC6INT                   : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t DMA0INT                   : 1;
} stc_irqc_irq19pend_field_t;

typedef struct
{
    __IO uint32_t MSC6INT                   : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t DMA1INT                   : 1;
} stc_irqc_irq20pend_field_t;

typedef struct
{
    __IO uint32_t MOSCI                     : 1;
    __IO uint32_t SOSCI                     : 1;
    __IO uint32_t MPLLI                     : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t WCI                       : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t MSWKUP                    : 1;
    __IO uint32_t RAMI                      : 1;
} stc_irqc_irq24pend_field_t;

typedef struct
{
    __IO uint32_t ADCI                      : 5;
} stc_irqc_irq25pend_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 5;
    __IO uint32_t VCI                       : 1;
} stc_irqc_irq26pend_field_t;

typedef struct
{
    __IO uint32_t TPI                       : 1;
    uint32_t RESERVED1                      : 2;
    __IO uint32_t TZI                       : 1;
} stc_irqc_irq28pend_field_t;

typedef struct
{
    __IO uint32_t OCMPU0                    : 1;
    __IO uint32_t OCMPU1                    : 1;
    __IO uint32_t OCMPU2                    : 1;
    __IO uint32_t OCMPU3                    : 1;
    __IO uint32_t OCMPU4                    : 1;
    __IO uint32_t OCMPU5                    : 1;
} stc_irqc_irq30pend_field_t;

typedef struct
{
    __IO uint32_t CTI0IRQ                   : 1;
    __IO uint32_t CTI1IRQ                   : 1;
    __IO uint32_t CTI2IRQ                   : 1;
    __IO uint32_t CTI3IRQ                   : 1;
    __IO uint32_t CTI4IRQ                   : 1;
    __IO uint32_t CTI5IRQ                   : 1;
    __IO uint32_t CTI6IRQ                   : 1;
    __IO uint32_t CTI7IRQ                   : 1;
    uint32_t RESERVED8                      :19;
    __IO uint32_t FLASHI                    : 1;
} stc_irqc_irq31pend_field_t;

typedef struct
{
    __IO uint8_t CLKSEL                     : 1;
    __IO uint8_t LCD_FRAME                  : 2;
    __IO uint8_t BIAS                       : 2;
    __IO uint8_t LCD_MODE                   : 3;
} stc_lcdc_lcdcr0_field_t;

typedef struct
{
    __IO uint8_t VLCD                       : 3;
    __IO uint8_t CT                         : 3;
    __IO uint8_t CMOD                       : 1;
} stc_lcdc_lcdcr1_field_t;

typedef struct
{
    __IO uint8_t CP_FREQ                    : 2;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t VSEL                       : 2;
    __IO uint8_t WSEL                       : 1;
} stc_lcdc_lcdcr2_field_t;

typedef struct
{
    __IO uint8_t LCD_EN                     : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t LCD_BUF                    : 2;
} stc_lcdc_lcdcr3_field_t;

typedef struct
{
    __IO uint8_t VE0                        : 1;
    __IO uint8_t VE1                        : 1;
    __IO uint8_t VE2                        : 1;
    __IO uint8_t VE3                        : 1;
    __IO uint8_t VE4                        : 1;
} stc_lcdc_lcddvc_field_t;

typedef struct
{
    __IO uint8_t COME0                      : 1;
    __IO uint8_t COME1                      : 1;
    __IO uint8_t COME2                      : 1;
    __IO uint8_t COME3                      : 1;
    __IO uint8_t COME4                      : 1;
    __IO uint8_t COME5                      : 1;
    __IO uint8_t COME6                      : 1;
    __IO uint8_t COME7                      : 1;
} stc_lcdc_lcdce0_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 3;
    __IO uint8_t SEGE3                      : 1;
    __IO uint8_t SEGE4                      : 1;
    __IO uint8_t SEGE5                      : 1;
    __IO uint8_t SEGE6                      : 1;
    __IO uint8_t SEGE7                      : 1;
} stc_lcdc_lcdse0_field_t;

typedef struct
{
    __IO uint8_t SEGE8                      : 1;
    __IO uint8_t SEGE9                      : 1;
    __IO uint8_t SEGE10                     : 1;
    __IO uint8_t SEGE11                     : 1;
    __IO uint8_t SEGE12                     : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t SEGE14                     : 1;
    __IO uint8_t SEGE15                     : 1;
} stc_lcdc_lcdse1_field_t;

typedef struct
{
    __IO uint8_t SEGE16                     : 1;
    __IO uint8_t SEGE17                     : 1;
    __IO uint8_t SEGE18                     : 1;
    __IO uint8_t SEGE19                     : 1;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t SEGE22                     : 1;
    __IO uint8_t SEGE23                     : 1;
} stc_lcdc_lcdse2_field_t;

typedef struct
{
    __IO uint8_t SEGE24                     : 1;
    __IO uint8_t SEGE25                     : 1;
    __IO uint8_t SEGE26                     : 1;
    __IO uint8_t SEGE27                     : 1;
} stc_lcdc_lcdse3_field_t;

typedef struct
{
    __IO uint8_t SEGE32                     : 1;
    __IO uint8_t SEGE33                     : 1;
    __IO uint8_t SEGE34                     : 1;
    __IO uint8_t SEGE35                     : 1;
    __IO uint8_t SEGE36                     : 1;
    __IO uint8_t SEGE37                     : 1;
    __IO uint8_t SEGE38                     : 1;
    __IO uint8_t SEGE39                     : 1;
} stc_lcdc_lcdse4_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_i2c_mr_field_t;

typedef struct
{
    __IO uint8_t INTF                       : 1;
    __IO uint8_t BERF                       : 1;
    __IO uint8_t INTE                       : 1;
    __IO uint8_t CNDDIE                     : 1;
    __IO uint8_t WTSEL                      : 1;
    __IO uint8_t ACKE                       : 1;
    __IO uint8_t OFITS                      : 1;
    __IO uint8_t MSS                        : 1;
} stc_msc_i2c_bc_field_t;

typedef struct
{
    __IO uint8_t BSS                        : 1;
    __IO uint8_t STPCC                      : 1;
    __IO uint8_t ITSCC                      : 1;
    __IO uint8_t ABL                        : 1;
    __IO uint8_t TRX                        : 1;
    __IO uint8_t RAD                        : 1;
    __IO uint8_t ACKF                       : 1;
    __IO uint8_t FBB                        : 1;
} stc_msc_i2c_bs_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    __IO uint8_t TBIIE                      : 1;
    __IO uint8_t DMAE                       : 1;
    __IO uint8_t TEFS                       : 1;
    __IO uint8_t RECLR                      : 1;
} stc_msc_i2c_sr_field_t;

typedef struct
{
    __IO uint16_t BRS                       :15;
} stc_msc_i2c_brs_field_t;

typedef struct
{
    __IO uint8_t ADDR                       : 7;
    __IO uint8_t AE                         : 1;
} stc_msc_i2c_sa_field_t;

typedef struct
{
    __IO uint8_t MSK                        : 7;
    __IO uint8_t EN                         : 1;
} stc_msc_i2c_samsk_field_t;

typedef struct
{
    __IO uint8_t BEC                        : 1;
    __IO uint8_t DOE                        : 1;
    __IO uint8_t SCLOC                      : 1;
    __IO uint8_t SDAOC                      : 1;
    __IO uint8_t SCLS                       : 1;
    __IO uint8_t SDAS                       : 1;
} stc_msc_i2c_ebcr_field_t;

typedef struct
{
    __IO uint8_t DOE                        : 1;
    __IO uint8_t CKE                        : 1;
    __IO uint8_t TDS                        : 1;
    __IO uint8_t CINV                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_spi_mr_field_t;

typedef struct
{
    __IO uint8_t TXE                        : 1;
    __IO uint8_t RXE                        : 1;
    __IO uint8_t TBIE                       : 1;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    __IO uint8_t SPIMODE                    : 1;
    __IO uint8_t MSS                        : 1;
    __IO uint8_t PCL                        : 1;
} stc_msc_spi_cr_field_t;

typedef struct
{
    __IO uint8_t DL                         : 3;
    __IO uint8_t DTRWS                      : 2;
    __IO uint8_t CSFE                       : 1;
    __IO uint8_t DL3                        : 1;
    __IO uint8_t SOPS                       : 1;
} stc_msc_spi_ecr_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    uint8_t RESERVED4                       : 3;
    __IO uint8_t RECLR                      : 1;
} stc_msc_spi_sr_field_t;

typedef struct
{
    __IO uint16_t BRS                       :15;
} stc_msc_spi_brs_field_t;

typedef struct
{
    __IO uint8_t CSHDLY                     : 8;
} stc_msc_spi_cstmg0_field_t;

