MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F146J8/mcu.h
#define bM0P_GPIO_FN_SEL07_SOT5B1                       *((volatile unsigned int*)(0x4266C3DCUL))
#define bM0P_GPIO_FN_SEL07_SCK5B0                       *((volatile unsigned int*)(0x4266C3E0UL))
#define bM0P_GPIO_FN_SEL07_SCK5B1                       *((volatile unsigned int*)(0x4266C3E4UL))
#define bM0P_GPIO_FN_SEL07_SCS50B0                      *((volatile unsigned int*)(0x4266C3E8UL))
#define bM0P_GPIO_FN_SEL07_SCS50B1                      *((volatile unsigned int*)(0x4266C3ECUL))
#define bM0P_GPIO_FN_SEL08_RTS6E0                       *((volatile unsigned int*)(0x4266C400UL))
#define bM0P_GPIO_FN_SEL08_RTS6E1                       *((volatile unsigned int*)(0x4266C404UL))
#define bM0P_GPIO_FN_SEL08_CTS6S0                       *((volatile unsigned int*)(0x4266C408UL))
#define bM0P_GPIO_FN_SEL08_CTS6S1                       *((volatile unsigned int*)(0x4266C40CUL))
#define bM0P_GPIO_FN_SEL08_SIN6S0                       *((volatile unsigned int*)(0x4266C410UL))
#define bM0P_GPIO_FN_SEL08_SIN6S1                       *((volatile unsigned int*)(0x4266C414UL))
#define bM0P_GPIO_FN_SEL08_SOT6B0                       *((volatile unsigned int*)(0x4266C418UL))
#define bM0P_GPIO_FN_SEL08_SOT6B1                       *((volatile unsigned int*)(0x4266C41CUL))
#define bM0P_GPIO_FN_SEL08_SCK6B0                       *((volatile unsigned int*)(0x4266C420UL))
#define bM0P_GPIO_FN_SEL08_SCK6B1                       *((volatile unsigned int*)(0x4266C424UL))
#define bM0P_GPIO_FN_SEL08_SCS60B0                      *((volatile unsigned int*)(0x4266C428UL))
#define bM0P_GPIO_FN_SEL08_SCS60B1                      *((volatile unsigned int*)(0x4266C42CUL))
#define bM0P_GPIO_FN_SEL08_SCS61E0                      *((volatile unsigned int*)(0x4266C430UL))
#define bM0P_GPIO_FN_SEL08_SCS61E1                      *((volatile unsigned int*)(0x4266C434UL))
#define bM0P_GPIO_FN_SEL08_SCS62E0                      *((volatile unsigned int*)(0x4266C438UL))
#define bM0P_GPIO_FN_SEL08_SCS62E1                      *((volatile unsigned int*)(0x4266C43CUL))
#define bM0P_GPIO_FN_SEL09_VCOE0                        *((volatile unsigned int*)(0x4266C480UL))
#define bM0P_GPIO_FN_SEL09_VCOE1                        *((volatile unsigned int*)(0x4266C484UL))
#define bM0P_GPIO_FN_SEL09_ADTGS                        *((volatile unsigned int*)(0x4266C4E0UL))
#define bM0P_GPIO_ODR0_P03                              *((volatile unsigned int*)(0x4266E00CUL))
#define bM0P_GPIO_ODR0_P04                              *((volatile unsigned int*)(0x4266E010UL))
#define bM0P_GPIO_ODR0_P05                              *((volatile unsigned int*)(0x4266E014UL))
#define bM0P_GPIO_ODR0_P06                              *((volatile unsigned int*)(0x4266E018UL))
#define bM0P_GPIO_ODR0_P07                              *((volatile unsigned int*)(0x4266E01CUL))
#define bM0P_GPIO_ODR1_P10                              *((volatile unsigned int*)(0x4266E080UL))
#define bM0P_GPIO_ODR1_P11                              *((volatile unsigned int*)(0x4266E084UL))
#define bM0P_GPIO_ODR1_P12                              *((volatile unsigned int*)(0x4266E088UL))
#define bM0P_GPIO_ODR1_P13                              *((volatile unsigned int*)(0x4266E08CUL))
#define bM0P_GPIO_ODR1_P14                              *((volatile unsigned int*)(0x4266E090UL))
#define bM0P_GPIO_ODR1_P15                              *((volatile unsigned int*)(0x4266E094UL))
#define bM0P_GPIO_ODR1_P16                              *((volatile unsigned int*)(0x4266E098UL))
#define bM0P_GPIO_ODR2_P20                              *((volatile unsigned int*)(0x4266E100UL))
#define bM0P_GPIO_ODR2_P21                              *((volatile unsigned int*)(0x4266E104UL))
#define bM0P_GPIO_ODR2_P22                              *((volatile unsigned int*)(0x4266E108UL))
#define bM0P_GPIO_ODR2_P23                              *((volatile unsigned int*)(0x4266E10CUL))
#define bM0P_GPIO_ODR2_P24                              *((volatile unsigned int*)(0x4266E110UL))
#define bM0P_GPIO_ODR3_P30                              *((volatile unsigned int*)(0x4266E180UL))
#define bM0P_GPIO_ODR3_P31                              *((volatile unsigned int*)(0x4266E184UL))
#define bM0P_GPIO_ODR3_P32                              *((volatile unsigned int*)(0x4266E188UL))
#define bM0P_GPIO_ODR4_P40                              *((volatile unsigned int*)(0x4266E200UL))
#define bM0P_GPIO_ODR4_P41                              *((volatile unsigned int*)(0x4266E204UL))
#define bM0P_GPIO_ODR4_P42                              *((volatile unsigned int*)(0x4266E208UL))
#define bM0P_GPIO_ODR4_P43                              *((volatile unsigned int*)(0x4266E20CUL))
#define bM0P_GPIO_ODR4_P44                              *((volatile unsigned int*)(0x4266E210UL))
#define bM0P_GPIO_ODR4_P45                              *((volatile unsigned int*)(0x4266E214UL))
#define bM0P_GPIO_ODR4_P46                              *((volatile unsigned int*)(0x4266E218UL))
#define bM0P_GPIO_ODR4_P47                              *((volatile unsigned int*)(0x4266E21CUL))
#define bM0P_GPIO_ODR5_P50                              *((volatile unsigned int*)(0x4266E280UL))
#define bM0P_GPIO_ODR5_P51                              *((volatile unsigned int*)(0x4266E284UL))
#define bM0P_GPIO_ODR5_P52                              *((volatile unsigned int*)(0x4266E288UL))
#define bM0P_GPIO_ODR6_P60                              *((volatile unsigned int*)(0x4266E300UL))
#define bM0P_GPIO_ODR6_P61                              *((volatile unsigned int*)(0x4266E304UL))
#define bM0P_GPIO_ODR6_P62                              *((volatile unsigned int*)(0x4266E308UL))
#define bM0P_GPIO_ODR6_P63                              *((volatile unsigned int*)(0x4266E30CUL))
#define bM0P_GPIO_ODR6_P64                              *((volatile unsigned int*)(0x4266E310UL))
#define bM0P_GPIO_ODR6_P65                              *((volatile unsigned int*)(0x4266E314UL))
#define bM0P_GPIO_ODR7_P70                              *((volatile unsigned int*)(0x4266E380UL))
#define bM0P_GPIO_ODR7_P71                              *((volatile unsigned int*)(0x4266E384UL))
#define bM0P_GPIO_ODR7_P72                              *((volatile unsigned int*)(0x4266E388UL))
#define bM0P_GPIO_ODR7_P73                              *((volatile unsigned int*)(0x4266E38CUL))
#define bM0P_GPIO_ODR7_P74                              *((volatile unsigned int*)(0x4266E390UL))
#define bM0P_GPIO_ODR7_P75                              *((volatile unsigned int*)(0x4266E394UL))
#define bM0P_GPIO_FSETE0_P03                            *((volatile unsigned int*)(0x4267200CUL))
#define bM0P_GPIO_FSETE0_P04                            *((volatile unsigned int*)(0x42672010UL))
#define bM0P_GPIO_FSETE0_P05                            *((volatile unsigned int*)(0x42672014UL))
#define bM0P_GPIO_FSETE0_P06                            *((volatile unsigned int*)(0x42672018UL))
#define bM0P_GPIO_FSETE0_P07                            *((volatile unsigned int*)(0x4267201CUL))
#define bM0P_GPIO_FSETE1_P10                            *((volatile unsigned int*)(0x42672080UL))
#define bM0P_GPIO_FSETE1_P11                            *((volatile unsigned int*)(0x42672084UL))
#define bM0P_GPIO_FSETE1_P12                            *((volatile unsigned int*)(0x42672088UL))
#define bM0P_GPIO_FSETE1_P13                            *((volatile unsigned int*)(0x4267208CUL))
#define bM0P_GPIO_FSETE1_P14                            *((volatile unsigned int*)(0x42672090UL))
#define bM0P_GPIO_FSETE1_P15                            *((volatile unsigned int*)(0x42672094UL))
#define bM0P_GPIO_FSETE1_P16                            *((volatile unsigned int*)(0x42672098UL))
#define bM0P_GPIO_FSETE2_P20                            *((volatile unsigned int*)(0x42672100UL))
#define bM0P_GPIO_FSETE2_P21                            *((volatile unsigned int*)(0x42672104UL))
#define bM0P_GPIO_FSETE2_P22                            *((volatile unsigned int*)(0x42672108UL))
#define bM0P_GPIO_FSETE2_P23                            *((volatile unsigned int*)(0x4267210CUL))
#define bM0P_GPIO_FSETE2_P24                            *((volatile unsigned int*)(0x42672110UL))
#define bM0P_GPIO_FSETE3_P30                            *((volatile unsigned int*)(0x42672180UL))
#define bM0P_GPIO_FSETE3_P31                            *((volatile unsigned int*)(0x42672184UL))
#define bM0P_GPIO_FSETE3_P32                            *((volatile unsigned int*)(0x42672188UL))
#define bM0P_GPIO_FSETE4_P40                            *((volatile unsigned int*)(0x42672200UL))
#define bM0P_GPIO_FSETE4_P41                            *((volatile unsigned int*)(0x42672204UL))
#define bM0P_GPIO_FSETE4_P42                            *((volatile unsigned int*)(0x42672208UL))
#define bM0P_GPIO_FSETE4_P43                            *((volatile unsigned int*)(0x4267220CUL))
#define bM0P_GPIO_FSETE4_P44                            *((volatile unsigned int*)(0x42672210UL))
#define bM0P_GPIO_FSETE4_P45                            *((volatile unsigned int*)(0x42672214UL))
#define bM0P_GPIO_FSETE4_P46                            *((volatile unsigned int*)(0x42672218UL))
#define bM0P_GPIO_FSETE4_P47                            *((volatile unsigned int*)(0x4267221CUL))
#define bM0P_GPIO_FSETE5_P50                            *((volatile unsigned int*)(0x42672280UL))
#define bM0P_GPIO_FSETE5_P51                            *((volatile unsigned int*)(0x42672284UL))
#define bM0P_GPIO_FSETE5_P52                            *((volatile unsigned int*)(0x42672288UL))
#define bM0P_GPIO_FSETE6_P60                            *((volatile unsigned int*)(0x42672300UL))
#define bM0P_GPIO_FSETE6_P61                            *((volatile unsigned int*)(0x42672304UL))
#define bM0P_GPIO_FSETE6_P62                            *((volatile unsigned int*)(0x42672308UL))
#define bM0P_GPIO_FSETE6_P63                            *((volatile unsigned int*)(0x4267230CUL))
#define bM0P_GPIO_FSETE6_P64                            *((volatile unsigned int*)(0x42672310UL))
#define bM0P_GPIO_FSETE6_P65                            *((volatile unsigned int*)(0x42672314UL))
#define bM0P_GPIO_FSETE7_P70                            *((volatile unsigned int*)(0x42672380UL))
#define bM0P_GPIO_FSETE7_P71                            *((volatile unsigned int*)(0x42672384UL))
#define bM0P_GPIO_FSETE7_P72                            *((volatile unsigned int*)(0x42672388UL))
#define bM0P_GPIO_FSETE7_P73                            *((volatile unsigned int*)(0x4267238CUL))
#define bM0P_GPIO_FSETE7_P74                            *((volatile unsigned int*)(0x42672390UL))
#define bM0P_GPIO_FSETE7_P75                            *((volatile unsigned int*)(0x42672394UL))
#define bM0P_HWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42220100UL))
#define bM0P_HWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42220104UL))
#define bM0P_HWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42220200UL))
#define bM0P_IRQC_IRQ_DSEL_AD0IS                        *((volatile unsigned int*)(0x42620014UL))
#define bM0P_IRQC_IRQ_DSEL_CT0IS                        *((volatile unsigned int*)(0x42620020UL))
#define bM0P_IRQC_IRQ_DSEL_CT2IS                        *((volatile unsigned int*)(0x42620024UL))
#define bM0P_IRQC_IRQ_DSEL_MSC4RXIS                     *((volatile unsigned int*)(0x42620050UL))
#define bM0P_IRQC_IRQ_DSEL_MSC4TXIS                     *((volatile unsigned int*)(0x42620054UL))
#define bM0P_IRQC_IRQ_DSEL_MSC5RXIS                     *((volatile unsigned int*)(0x42620058UL))
#define bM0P_IRQC_IRQ_DSEL_MSC5TXIS                     *((volatile unsigned int*)(0x4262005CUL))
#define bM0P_IRQC_IRQ_DSEL_MSC6RXIS                     *((volatile unsigned int*)(0x42620060UL))
#define bM0P_IRQC_IRQ_DSEL_MSC6TXIS                     *((volatile unsigned int*)(0x42620064UL))
#define bM0P_IRQC_IRQ_DSEL_E0IS                         *((volatile unsigned int*)(0x42620070UL))
#define bM0P_IRQC_IRQ_DSEL_E1IS                         *((volatile unsigned int*)(0x42620074UL))
#define bM0P_IRQC_IRQ_DSEL_E2IS                         *((volatile unsigned int*)(0x42620078UL))
#define bM0P_IRQC_IRQ_DSEL_E3IS                         *((volatile unsigned int*)(0x4262007CUL))
#define bM0P_IRQC_IRQ_ST02_NMI                          *((volatile unsigned int*)(0x42620200UL))
#define bM0P_IRQC_IRQ_ST02_HWWDG                        *((volatile unsigned int*)(0x42620204UL))
#define bM0P_IRQC_IRQ00PEND_AFDI                        *((volatile unsigned int*)(0x42620280UL))
#define bM0P_IRQC_IRQ01PEND_SWWDG                       *((volatile unsigned int*)(0x42620300UL))
#define bM0P_IRQC_IRQ02PEND_LVD                         *((volatile unsigned int*)(0x42620380UL))
#define bM0P_IRQC_IRQ03PEND_MEMIF                       *((volatile unsigned int*)(0x42620400UL))
#define bM0P_IRQC_IRQ03PEND_WOU10                       *((volatile unsigned int*)(0x42620404UL))
#define bM0P_IRQC_IRQ03PEND_WOU32                       *((volatile unsigned int*)(0x42620408UL))
#define bM0P_IRQC_IRQ03PEND_WOU54                       *((volatile unsigned int*)(0x4262040CUL))
#define bM0P_IRQC_IRQ04PEND_EXTI0                       *((volatile unsigned int*)(0x42620480UL))
#define bM0P_IRQC_IRQ04PEND_EXTI1                       *((volatile unsigned int*)(0x42620484UL))
#define bM0P_IRQC_IRQ04PEND_EXTI2                       *((volatile unsigned int*)(0x42620488UL))
#define bM0P_IRQC_IRQ04PEND_EXTI3                       *((volatile unsigned int*)(0x4262048CUL))
#define bM0P_IRQC_IRQ04PEND_EXTI4                       *((volatile unsigned int*)(0x42620490UL))
#define bM0P_IRQC_IRQ04PEND_EXTI5                       *((volatile unsigned int*)(0x42620494UL))
#define bM0P_IRQC_IRQ04PEND_EXTI6                       *((volatile unsigned int*)(0x42620498UL))
#define bM0P_IRQC_IRQ04PEND_EXTI7                       *((volatile unsigned int*)(0x4262049CUL))
#define bM0P_IRQC_IRQ05PEND_EXTI8                       *((volatile unsigned int*)(0x42620500UL))
#define bM0P_IRQC_IRQ05PEND_EXTI9                       *((volatile unsigned int*)(0x42620504UL))
#define bM0P_IRQC_IRQ05PEND_EXTI10                      *((volatile unsigned int*)(0x42620508UL))
#define bM0P_IRQC_IRQ05PEND_EXTI11                      *((volatile unsigned int*)(0x4262050CUL))
#define bM0P_IRQC_IRQ05PEND_EXTI12                      *((volatile unsigned int*)(0x42620510UL))
#define bM0P_IRQC_IRQ05PEND_EXTI13                      *((volatile unsigned int*)(0x42620514UL))
#define bM0P_IRQC_IRQ05PEND_EXTI14                      *((volatile unsigned int*)(0x42620518UL))
#define bM0P_IRQC_IRQ05PEND_EXTI15                      *((volatile unsigned int*)(0x4262051CUL))
#define bM0P_IRQC_IRQ06PEND_DT10                        *((volatile unsigned int*)(0x42620580UL))
#define bM0P_IRQC_IRQ06PEND_DT11                        *((volatile unsigned int*)(0x42620584UL))
#define bM0P_IRQC_IRQ15PEND_MSC4INT                     *((volatile unsigned int*)(0x42620A00UL))
#define bM0P_IRQC_IRQ16PEND_MSC4INT0                    *((volatile unsigned int*)(0x42620A80UL))
#define bM0P_IRQC_IRQ16PEND_MSC4INT1                    *((volatile unsigned int*)(0x42620A84UL))
#define bM0P_IRQC_IRQ17PEND_MSC5NT                      *((volatile unsigned int*)(0x42620B00UL))
#define bM0P_IRQC_IRQ18PEND_MSC5INT0                    *((volatile unsigned int*)(0x42620B80UL))
#define bM0P_IRQC_IRQ18PEND_MSC5INT1                    *((volatile unsigned int*)(0x42620B84UL))
#define bM0P_IRQC_IRQ19PEND_MSC6INT                     *((volatile unsigned int*)(0x42620C00UL))
#define bM0P_IRQC_IRQ19PEND_DMA0INT                     *((volatile unsigned int*)(0x42620C10UL))
#define bM0P_IRQC_IRQ20PEND_MSC6INT                     *((volatile unsigned int*)(0x42620C80UL))
#define bM0P_IRQC_IRQ20PEND_DMA1INT                     *((volatile unsigned int*)(0x42620C90UL))
#define bM0P_IRQC_IRQ24PEND_MOSCI                       *((volatile unsigned int*)(0x42620E80UL))
#define bM0P_IRQC_IRQ24PEND_SOSCI                       *((volatile unsigned int*)(0x42620E84UL))
#define bM0P_IRQC_IRQ24PEND_MPLLI                       *((volatile unsigned int*)(0x42620E88UL))
#define bM0P_IRQC_IRQ24PEND_WCI                         *((volatile unsigned int*)(0x42620E90UL))
#define bM0P_IRQC_IRQ24PEND_MSWKUP                      *((volatile unsigned int*)(0x42620E98UL))
#define bM0P_IRQC_IRQ24PEND_RAMI                        *((volatile unsigned int*)(0x42620E9CUL))
#define bM0P_IRQC_IRQ25PEND_ADCI0                       *((volatile unsigned int*)(0x42620F00UL))
#define bM0P_IRQC_IRQ25PEND_ADCI1                       *((volatile unsigned int*)(0x42620F04UL))
#define bM0P_IRQC_IRQ25PEND_ADCI2                       *((volatile unsigned int*)(0x42620F08UL))
#define bM0P_IRQC_IRQ25PEND_ADCI3                       *((volatile unsigned int*)(0x42620F0CUL))
#define bM0P_IRQC_IRQ25PEND_ADCI4                       *((volatile unsigned int*)(0x42620F10UL))
#define bM0P_IRQC_IRQ26PEND_VCI                         *((volatile unsigned int*)(0x42620F94UL))
#define bM0P_IRQC_IRQ28PEND_TPI                         *((volatile unsigned int*)(0x42621080UL))
#define bM0P_IRQC_IRQ28PEND_TZI                         *((volatile unsigned int*)(0x4262108CUL))
#define bM0P_IRQC_IRQ30PEND_OCMPU0                      *((volatile unsigned int*)(0x42621180UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU1                      *((volatile unsigned int*)(0x42621184UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU2                      *((volatile unsigned int*)(0x42621188UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU3                      *((volatile unsigned int*)(0x4262118CUL))
#define bM0P_IRQC_IRQ30PEND_OCMPU4                      *((volatile unsigned int*)(0x42621190UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU5                      *((volatile unsigned int*)(0x42621194UL))
#define bM0P_IRQC_IRQ31PEND_CTI0IRQ                     *((volatile unsigned int*)(0x42621200UL))
#define bM0P_IRQC_IRQ31PEND_CTI1IRQ                     *((volatile unsigned int*)(0x42621204UL))
#define bM0P_IRQC_IRQ31PEND_CTI2IRQ                     *((volatile unsigned int*)(0x42621208UL))
#define bM0P_IRQC_IRQ31PEND_CTI3IRQ                     *((volatile unsigned int*)(0x4262120CUL))
#define bM0P_IRQC_IRQ31PEND_CTI4IRQ                     *((volatile unsigned int*)(0x42621210UL))
#define bM0P_IRQC_IRQ31PEND_CTI5IRQ                     *((volatile unsigned int*)(0x42621214UL))
#define bM0P_IRQC_IRQ31PEND_CTI6IRQ                     *((volatile unsigned int*)(0x42621218UL))
#define bM0P_IRQC_IRQ31PEND_CTI7IRQ                     *((volatile unsigned int*)(0x4262121CUL))
#define bM0P_IRQC_IRQ31PEND_FLASHI                      *((volatile unsigned int*)(0x4262126CUL))
#define bM0P_LCDC_LCDCR0_CLKSEL                         *((volatile unsigned int*)(0x42640000UL))
#define bM0P_LCDC_LCDCR0_LCD_FRAME0                     *((volatile unsigned int*)(0x42640004UL))
#define bM0P_LCDC_LCDCR0_LCD_FRAME1                     *((volatile unsigned int*)(0x42640008UL))
#define bM0P_LCDC_LCDCR0_BIAS0                          *((volatile unsigned int*)(0x4264000CUL))
#define bM0P_LCDC_LCDCR0_BIAS1                          *((volatile unsigned int*)(0x42640010UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE0                      *((volatile unsigned int*)(0x42640014UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE1                      *((volatile unsigned int*)(0x42640018UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE2                      *((volatile unsigned int*)(0x4264001CUL))
#define bM0P_LCDC_LCDCR1_VLCD0                          *((volatile unsigned int*)(0x42640020UL))
#define bM0P_LCDC_LCDCR1_VLCD1                          *((volatile unsigned int*)(0x42640024UL))
#define bM0P_LCDC_LCDCR1_VLCD2                          *((volatile unsigned int*)(0x42640028UL))
#define bM0P_LCDC_LCDCR1_CT0                            *((volatile unsigned int*)(0x4264002CUL))
#define bM0P_LCDC_LCDCR1_CT1                            *((volatile unsigned int*)(0x42640030UL))
#define bM0P_LCDC_LCDCR1_CT2                            *((volatile unsigned int*)(0x42640034UL))
#define bM0P_LCDC_LCDCR1_CMOD                           *((volatile unsigned int*)(0x42640038UL))
#define bM0P_LCDC_LCDCR2_CP_FREQ0                       *((volatile unsigned int*)(0x42640040UL))
#define bM0P_LCDC_LCDCR2_CP_FREQ1                       *((volatile unsigned int*)(0x42640044UL))
#define bM0P_LCDC_LCDCR2_VSEL0                          *((volatile unsigned int*)(0x42640054UL))
#define bM0P_LCDC_LCDCR2_VSEL1                          *((volatile unsigned int*)(0x42640058UL))
#define bM0P_LCDC_LCDCR2_WSEL                           *((volatile unsigned int*)(0x4264005CUL))
#define bM0P_LCDC_LCDCR3_LCD_EN                         *((volatile unsigned int*)(0x42640060UL))
#define bM0P_LCDC_LCDCR3_LCD_BUF0                       *((volatile unsigned int*)(0x42640070UL))
#define bM0P_LCDC_LCDCR3_LCD_BUF1                       *((volatile unsigned int*)(0x42640074UL))
#define bM0P_LCDC_LCDDVC_VE0                            *((volatile unsigned int*)(0x42640080UL))
#define bM0P_LCDC_LCDDVC_VE1                            *((volatile unsigned int*)(0x42640084UL))
#define bM0P_LCDC_LCDDVC_VE2                            *((volatile unsigned int*)(0x42640088UL))
#define bM0P_LCDC_LCDDVC_VE3                            *((volatile unsigned int*)(0x4264008CUL))
#define bM0P_LCDC_LCDDVC_VE4                            *((volatile unsigned int*)(0x42640090UL))
#define bM0P_LCDC_LCDCE0_COME0                          *((volatile unsigned int*)(0x42640100UL))
#define bM0P_LCDC_LCDCE0_COME1                          *((volatile unsigned int*)(0x42640104UL))
#define bM0P_LCDC_LCDCE0_COME2                          *((volatile unsigned int*)(0x42640108UL))
#define bM0P_LCDC_LCDCE0_COME3                          *((volatile unsigned int*)(0x4264010CUL))
#define bM0P_LCDC_LCDCE0_COME4                          *((volatile unsigned int*)(0x42640110UL))
#define bM0P_LCDC_LCDCE0_COME5                          *((volatile unsigned int*)(0x42640114UL))
#define bM0P_LCDC_LCDCE0_COME6                          *((volatile unsigned int*)(0x42640118UL))
#define bM0P_LCDC_LCDCE0_COME7                          *((volatile unsigned int*)(0x4264011CUL))
#define bM0P_LCDC_LCDSE0_SEGE3                          *((volatile unsigned int*)(0x4264018CUL))
#define bM0P_LCDC_LCDSE0_SEGE4                          *((volatile unsigned int*)(0x42640190UL))
#define bM0P_LCDC_LCDSE0_SEGE5                          *((volatile unsigned int*)(0x42640194UL))
#define bM0P_LCDC_LCDSE0_SEGE6                          *((volatile unsigned int*)(0x42640198UL))
#define bM0P_LCDC_LCDSE0_SEGE7                          *((volatile unsigned int*)(0x4264019CUL))
#define bM0P_LCDC_LCDSE1_SEGE8                          *((volatile unsigned int*)(0x426401A0UL))
#define bM0P_LCDC_LCDSE1_SEGE9                          *((volatile unsigned int*)(0x426401A4UL))
#define bM0P_LCDC_LCDSE1_SEGE10                         *((volatile unsigned int*)(0x426401A8UL))
#define bM0P_LCDC_LCDSE1_SEGE11                         *((volatile unsigned int*)(0x426401ACUL))
#define bM0P_LCDC_LCDSE1_SEGE12                         *((volatile unsigned int*)(0x426401B0UL))
#define bM0P_LCDC_LCDSE1_SEGE14                         *((volatile unsigned int*)(0x426401B8UL))
#define bM0P_LCDC_LCDSE1_SEGE15                         *((volatile unsigned int*)(0x426401BCUL))
#define bM0P_LCDC_LCDSE2_SEGE16                         *((volatile unsigned int*)(0x426401C0UL))
#define bM0P_LCDC_LCDSE2_SEGE17                         *((volatile unsigned int*)(0x426401C4UL))
#define bM0P_LCDC_LCDSE2_SEGE18                         *((volatile unsigned int*)(0x426401C8UL))
#define bM0P_LCDC_LCDSE2_SEGE19                         *((volatile unsigned int*)(0x426401CCUL))
