MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F146J8/mcu.h
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY30               *((volatile unsigned int*)(0x425C0078UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY31               *((volatile unsigned int*)(0x425C007CUL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM0                *((volatile unsigned int*)(0x425C0080UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM1                *((volatile unsigned int*)(0x425C0084UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM2                *((volatile unsigned int*)(0x425C0088UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM3                *((volatile unsigned int*)(0x425C008CUL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM4                *((volatile unsigned int*)(0x425C0090UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM5                *((volatile unsigned int*)(0x425C0094UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM6                *((volatile unsigned int*)(0x425C0098UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM7                *((volatile unsigned int*)(0x425C009CUL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM0                *((volatile unsigned int*)(0x425C0100UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM1                *((volatile unsigned int*)(0x425C0104UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM2                *((volatile unsigned int*)(0x425C0108UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM3                *((volatile unsigned int*)(0x425C010CUL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV0                    *((volatile unsigned int*)(0x425C0200UL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV1                    *((volatile unsigned int*)(0x425C0204UL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV2                    *((volatile unsigned int*)(0x425C0208UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HXSEL0                 *((volatile unsigned int*)(0x425C0400UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HXSEL1                 *((volatile unsigned int*)(0x425C0404UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HIBS0                  *((volatile unsigned int*)(0x425C0440UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HIBS1                  *((volatile unsigned int*)(0x425C0444UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS0                  *((volatile unsigned int*)(0x425C0640UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS1                  *((volatile unsigned int*)(0x425C0644UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS2                  *((volatile unsigned int*)(0x425C0648UL))
#define bM0P_PARITY_PARITY_CTL_PE                       *((volatile unsigned int*)(0x42780000UL))
#define bM0P_PARITY_PARITY_CTL_PIE                      *((volatile unsigned int*)(0x42780004UL))
#define bM0P_PARITY_PARITY_CTL_PERROR                   *((volatile unsigned int*)(0x42780010UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR0                   *((volatile unsigned int*)(0x42780080UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR1                   *((volatile unsigned int*)(0x42780084UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR2                   *((volatile unsigned int*)(0x42780088UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR3                   *((volatile unsigned int*)(0x4278008CUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR4                   *((volatile unsigned int*)(0x42780090UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR5                   *((volatile unsigned int*)(0x42780094UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR6                   *((volatile unsigned int*)(0x42780098UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR7                   *((volatile unsigned int*)(0x4278009CUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR8                   *((volatile unsigned int*)(0x427800A0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR9                   *((volatile unsigned int*)(0x427800A4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR10                  *((volatile unsigned int*)(0x427800A8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR11                  *((volatile unsigned int*)(0x427800ACUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR12                  *((volatile unsigned int*)(0x427800B0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR13                  *((volatile unsigned int*)(0x427800B4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR14                  *((volatile unsigned int*)(0x427800B8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR15                  *((volatile unsigned int*)(0x427800BCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR16                  *((volatile unsigned int*)(0x427800C0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR17                  *((volatile unsigned int*)(0x427800C4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR18                  *((volatile unsigned int*)(0x427800C8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR19                  *((volatile unsigned int*)(0x427800CCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR20                  *((volatile unsigned int*)(0x427800D0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR21                  *((volatile unsigned int*)(0x427800D4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR22                  *((volatile unsigned int*)(0x427800D8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR23                  *((volatile unsigned int*)(0x427800DCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR24                  *((volatile unsigned int*)(0x427800E0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR25                  *((volatile unsigned int*)(0x427800E4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR26                  *((volatile unsigned int*)(0x427800E8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR27                  *((volatile unsigned int*)(0x427800ECUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR28                  *((volatile unsigned int*)(0x427800F0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR29                  *((volatile unsigned int*)(0x427800F4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR30                  *((volatile unsigned int*)(0x427800F8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR31                  *((volatile unsigned int*)(0x427800FCUL))
#define bM0P_PCG_CLKEN0_MSC4CK                          *((volatile unsigned int*)(0x42782010UL))
#define bM0P_PCG_CLKEN0_MSC5CK                          *((volatile unsigned int*)(0x42782014UL))
#define bM0P_PCG_CLKEN0_MSC6CK                          *((volatile unsigned int*)(0x42782018UL))
#define bM0P_PCG_CLKEN0_ADCCK                           *((volatile unsigned int*)(0x42782040UL))
#define bM0P_PCG_CLKEN0_DMACK                           *((volatile unsigned int*)(0x42782060UL))
#define bM0P_PCG_CLKEN0_GIOCK                           *((volatile unsigned int*)(0x42782070UL))
#define bM0P_PCG_RSTCTL0_MSC4RST                        *((volatile unsigned int*)(0x42782090UL))
#define bM0P_PCG_RSTCTL0_MSC5RST                        *((volatile unsigned int*)(0x42782094UL))
#define bM0P_PCG_RSTCTL0_MSC6RST                        *((volatile unsigned int*)(0x42782098UL))
#define bM0P_PCG_RSTCTL0_ADCRST                         *((volatile unsigned int*)(0x427820C0UL))
#define bM0P_PCG_RSTCTL0_DMARST                         *((volatile unsigned int*)(0x427820E0UL))
#define bM0P_PCG_CLKEN1_CTCK                            *((volatile unsigned int*)(0x42782200UL))
#define bM0P_PCG_CLKEN1_VCCK                            *((volatile unsigned int*)(0x42782210UL))
#define bM0P_PCG_CLKEN1_TM4CK                           *((volatile unsigned int*)(0x42782220UL))
#define bM0P_PCG_CLKEN1_OPA0CK                          *((volatile unsigned int*)(0x42782230UL))
#define bM0P_PCG_CLKEN1_OPA1CK                          *((volatile unsigned int*)(0x42782234UL))
#define bM0P_PCG_RSTCTL1_CTMRST                         *((volatile unsigned int*)(0x42782280UL))
#define bM0P_PCG_RSTCTL1_VCRST                          *((volatile unsigned int*)(0x42782290UL))
#define bM0P_PCG_RSTCTL1_TM4RST                         *((volatile unsigned int*)(0x427822A0UL))
#define bM0P_PCG_RSTCTL1_OPA0RST                        *((volatile unsigned int*)(0x427822B0UL))
#define bM0P_PCG_RSTCTL1_OPA1RST                        *((volatile unsigned int*)(0x427822B4UL))
#define bM0P_PCG_CLKEN2_LCDCCK                          *((volatile unsigned int*)(0x42782440UL))
#define bM0P_PCG_RSTCTL2_LCDCRST                        *((volatile unsigned int*)(0x427824C0UL))
#define bM0P_SWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42240100UL))
#define bM0P_SWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42240104UL))
#define bM0P_SWWDT_WDT_CTL_TMWD0                        *((volatile unsigned int*)(0x42240108UL))
#define bM0P_SWWDT_WDT_CTL_TMWD1                        *((volatile unsigned int*)(0x4224010CUL))
#define bM0P_SWWDT_WDT_CTL_WDM                          *((volatile unsigned int*)(0x42240110UL))
#define bM0P_SWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42240200UL))
#define bM0P_SWWDT_WDT_MDC_TRG                          *((volatile unsigned int*)(0x42240300UL))
#define bM0P_UID_UIDR0_UID0                             *((volatile unsigned int*)(0x42002000UL))
#define bM0P_UID_UIDR0_UID1                             *((volatile unsigned int*)(0x42002004UL))
#define bM0P_UID_UIDR0_UID2                             *((volatile unsigned int*)(0x42002008UL))
#define bM0P_UID_UIDR0_UID3                             *((volatile unsigned int*)(0x4200200CUL))
#define bM0P_UID_UIDR0_UID4                             *((volatile unsigned int*)(0x42002010UL))
#define bM0P_UID_UIDR0_UID5                             *((volatile unsigned int*)(0x42002014UL))
#define bM0P_UID_UIDR0_UID6                             *((volatile unsigned int*)(0x42002018UL))
#define bM0P_UID_UIDR0_UID7                             *((volatile unsigned int*)(0x4200201CUL))
#define bM0P_UID_UIDR0_UID8                             *((volatile unsigned int*)(0x42002020UL))
#define bM0P_UID_UIDR0_UID9                             *((volatile unsigned int*)(0x42002024UL))
#define bM0P_UID_UIDR0_UID10                            *((volatile unsigned int*)(0x42002028UL))
#define bM0P_UID_UIDR0_UID11                            *((volatile unsigned int*)(0x4200202CUL))
#define bM0P_UID_UIDR0_UID12                            *((volatile unsigned int*)(0x42002030UL))
#define bM0P_UID_UIDR0_UID13                            *((volatile unsigned int*)(0x42002034UL))
#define bM0P_UID_UIDR0_UID14                            *((volatile unsigned int*)(0x42002038UL))
#define bM0P_UID_UIDR0_UID15                            *((volatile unsigned int*)(0x4200203CUL))
#define bM0P_UID_UIDR0_UID16                            *((volatile unsigned int*)(0x42002040UL))
#define bM0P_UID_UIDR0_UID17                            *((volatile unsigned int*)(0x42002044UL))
#define bM0P_UID_UIDR0_UID18                            *((volatile unsigned int*)(0x42002048UL))
#define bM0P_UID_UIDR0_UID19                            *((volatile unsigned int*)(0x4200204CUL))
#define bM0P_UID_UIDR0_UID20                            *((volatile unsigned int*)(0x42002050UL))
#define bM0P_UID_UIDR0_UID21                            *((volatile unsigned int*)(0x42002054UL))
#define bM0P_UID_UIDR0_UID22                            *((volatile unsigned int*)(0x42002058UL))
#define bM0P_UID_UIDR0_UID23                            *((volatile unsigned int*)(0x4200205CUL))
#define bM0P_UID_UIDR0_UID24                            *((volatile unsigned int*)(0x42002060UL))
#define bM0P_UID_UIDR0_UID25                            *((volatile unsigned int*)(0x42002064UL))
#define bM0P_UID_UIDR0_UID26                            *((volatile unsigned int*)(0x42002068UL))
#define bM0P_UID_UIDR0_UID27                            *((volatile unsigned int*)(0x4200206CUL))
#define bM0P_UID_UIDR0_UID28                            *((volatile unsigned int*)(0x42002070UL))
#define bM0P_UID_UIDR0_UID29                            *((volatile unsigned int*)(0x42002074UL))
#define bM0P_UID_UIDR0_UID30                            *((volatile unsigned int*)(0x42002078UL))
#define bM0P_UID_UIDR0_UID31                            *((volatile unsigned int*)(0x4200207CUL))
#define bM0P_UID_UIDR1_UID0                             *((volatile unsigned int*)(0x42002080UL))
#define bM0P_UID_UIDR1_UID1                             *((volatile unsigned int*)(0x42002084UL))
#define bM0P_UID_UIDR1_UID2                             *((volatile unsigned int*)(0x42002088UL))
#define bM0P_UID_UIDR1_UID3                             *((volatile unsigned int*)(0x4200208CUL))
#define bM0P_UID_UIDR1_UID4                             *((volatile unsigned int*)(0x42002090UL))
#define bM0P_UID_UIDR1_UID5                             *((volatile unsigned int*)(0x42002094UL))
#define bM0P_UID_UIDR1_UID6                             *((volatile unsigned int*)(0x42002098UL))
#define bM0P_UID_UIDR1_UID7                             *((volatile unsigned int*)(0x4200209CUL))
#define bM0P_UID_UIDR1_UID8                             *((volatile unsigned int*)(0x420020A0UL))
#define bM0P_UID_UIDR1_UID9                             *((volatile unsigned int*)(0x420020A4UL))
#define bM0P_UID_UIDR1_UID10                            *((volatile unsigned int*)(0x420020A8UL))
#define bM0P_UID_UIDR1_UID11                            *((volatile unsigned int*)(0x420020ACUL))
#define bM0P_UID_UIDR1_UID12                            *((volatile unsigned int*)(0x420020B0UL))
#define bM0P_UID_UIDR1_UID13                            *((volatile unsigned int*)(0x420020B4UL))
#define bM0P_UID_UIDR1_UID14                            *((volatile unsigned int*)(0x420020B8UL))
#define bM0P_UID_UIDR1_UID15                            *((volatile unsigned int*)(0x420020BCUL))
#define bM0P_UID_UIDR1_UID16                            *((volatile unsigned int*)(0x420020C0UL))
#define bM0P_UID_UIDR1_UID17                            *((volatile unsigned int*)(0x420020C4UL))
#define bM0P_UID_UIDR1_UID18                            *((volatile unsigned int*)(0x420020C8UL))
#define bM0P_UID_UIDR1_UID19                            *((volatile unsigned int*)(0x420020CCUL))
#define bM0P_UID_UIDR1_UID20                            *((volatile unsigned int*)(0x420020D0UL))
#define bM0P_UID_UIDR1_UID21                            *((volatile unsigned int*)(0x420020D4UL))
#define bM0P_UID_UIDR1_UID22                            *((volatile unsigned int*)(0x420020D8UL))
#define bM0P_UID_UIDR1_UID23                            *((volatile unsigned int*)(0x420020DCUL))
#define bM0P_UID_UIDR1_UID24                            *((volatile unsigned int*)(0x420020E0UL))
#define bM0P_UID_UIDR1_UID25                            *((volatile unsigned int*)(0x420020E4UL))
#define bM0P_UID_UIDR1_UID26                            *((volatile unsigned int*)(0x420020E8UL))
#define bM0P_UID_UIDR1_UID27                            *((volatile unsigned int*)(0x420020ECUL))
#define bM0P_UID_UIDR1_UID28                            *((volatile unsigned int*)(0x420020F0UL))
#define bM0P_UID_UIDR1_UID29                            *((volatile unsigned int*)(0x420020F4UL))
#define bM0P_UID_UIDR1_UID30                            *((volatile unsigned int*)(0x420020F8UL))
#define bM0P_UID_UIDR1_UID31                            *((volatile unsigned int*)(0x420020FCUL))
#define bM0P_UID_UIDR2_UID0                             *((volatile unsigned int*)(0x42002100UL))
#define bM0P_UID_UIDR2_UID1                             *((volatile unsigned int*)(0x42002104UL))
#define bM0P_UID_UIDR2_UID2                             *((volatile unsigned int*)(0x42002108UL))
#define bM0P_UID_UIDR2_UID3                             *((volatile unsigned int*)(0x4200210CUL))
#define bM0P_UID_UIDR2_UID4                             *((volatile unsigned int*)(0x42002110UL))
#define bM0P_UID_UIDR2_UID5                             *((volatile unsigned int*)(0x42002114UL))
#define bM0P_UID_UIDR2_UID6                             *((volatile unsigned int*)(0x42002118UL))
#define bM0P_UID_UIDR2_UID7                             *((volatile unsigned int*)(0x4200211CUL))
#define bM0P_UID_UIDR2_UID8                             *((volatile unsigned int*)(0x42002120UL))
#define bM0P_UID_UIDR2_UID9                             *((volatile unsigned int*)(0x42002124UL))
#define bM0P_UID_UIDR2_UID10                            *((volatile unsigned int*)(0x42002128UL))
#define bM0P_UID_UIDR2_UID11                            *((volatile unsigned int*)(0x4200212CUL))
#define bM0P_UID_UIDR2_UID12                            *((volatile unsigned int*)(0x42002130UL))
#define bM0P_UID_UIDR2_UID13                            *((volatile unsigned int*)(0x42002134UL))
#define bM0P_UID_UIDR2_UID14                            *((volatile unsigned int*)(0x42002138UL))
#define bM0P_UID_UIDR2_UID15                            *((volatile unsigned int*)(0x4200213CUL))
#define bM0P_VC_VC_CTL1_VC_EN                           *((volatile unsigned int*)(0x42786000UL))
#define bM0P_VC_VC_CTL1_VC_OUT                          *((volatile unsigned int*)(0x42786004UL))
#define bM0P_VC_VC_CTL1_VC_NMODE                        *((volatile unsigned int*)(0x42786008UL))
#define bM0P_VC_VC_CTL1_VC_COMPSL0                      *((volatile unsigned int*)(0x4278600CUL))
#define bM0P_VC_VC_CTL1_VC_COMPSL1                      *((volatile unsigned int*)(0x42786010UL))
#define bM0P_VC_VC_CTL2_VC_FILTER_EN                    *((volatile unsigned int*)(0x42786080UL))
#define bM0P_VC_VC_CTL2_VC_RESPONSE0                    *((volatile unsigned int*)(0x42786084UL))
#define bM0P_VC_VC_CTL2_VC_RESPONSE1                    *((volatile unsigned int*)(0x42786088UL))
#define bM0P_VC_VC_CTL2_VC_RESPONSE2                    *((volatile unsigned int*)(0x4278608CUL))
#define bM0P_VC_VC_CTL2_VCINT_EDGE0                     *((volatile unsigned int*)(0x42786094UL))
#define bM0P_VC_VC_CTL2_VCINT_EDGE1                     *((volatile unsigned int*)(0x42786098UL))
#define bM0P_VC_VC_CTL2_VCINT_HIGH                      *((volatile unsigned int*)(0x4278609CUL))
#define bM0P_VC_VC_CTL2_VC2PT                           *((volatile unsigned int*)(0x427860A0UL))
#define bM0P_VC_VC_CTL2_VCIE                            *((volatile unsigned int*)(0x427860A4UL))
#define bM0P_VC_VC_CTL2_VCIF                            *((volatile unsigned int*)(0x427860A8UL))
#define bM0P_VC_VC_CTL2_VC_HYS_SEL                      *((volatile unsigned int*)(0x427860ACUL))
#define bM0P_VC_VC_CTL3_VC_TM0G                         *((volatile unsigned int*)(0x42786100UL))
#define bM0P_VC_VC_CTL3_VC_TM2G                         *((volatile unsigned int*)(0x42786104UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR0                 *((volatile unsigned int*)(0x426A0000UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR1                 *((volatile unsigned int*)(0x426A0004UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR2                 *((volatile unsigned int*)(0x426A0008UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR3                 *((volatile unsigned int*)(0x426A000CUL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR4                 *((volatile unsigned int*)(0x426A0010UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD0                 *((volatile unsigned int*)(0x426A0020UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD1                 *((volatile unsigned int*)(0x426A0024UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD2                 *((volatile unsigned int*)(0x426A0028UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD3                 *((volatile unsigned int*)(0x426A002CUL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD4                 *((volatile unsigned int*)(0x426A0030UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SRST                  *((volatile unsigned int*)(0x426A0040UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_EN                    *((volatile unsigned int*)(0x426A0060UL))
#define bM0P_WSUNIT_LVD_INT_STR_LVD1_IF                 *((volatile unsigned int*)(0x426A0080UL))
#define bM0P_WSUNIT_LVD_INT_STR_LVD2_IF                 *((volatile unsigned int*)(0x426A00C0UL))
#define bM0P_WSUNIT_LVD_CLR_LVD1_CLR                    *((volatile unsigned int*)(0x426A0100UL))
#define bM0P_WSUNIT_LVD_CLR_LVD2_CLR                    *((volatile unsigned int*)(0x426A0140UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR0                 *((volatile unsigned int*)(0x426A0200UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR1                 *((volatile unsigned int*)(0x426A0204UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR2                 *((volatile unsigned int*)(0x426A0208UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR3                 *((volatile unsigned int*)(0x426A020CUL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR4                 *((volatile unsigned int*)(0x426A0210UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD0                 *((volatile unsigned int*)(0x426A0220UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD1                 *((volatile unsigned int*)(0x426A0224UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD2                 *((volatile unsigned int*)(0x426A0228UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD3                 *((volatile unsigned int*)(0x426A022CUL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD4                 *((volatile unsigned int*)(0x426A0230UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SRST                  *((volatile unsigned int*)(0x426A0240UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_EN                    *((volatile unsigned int*)(0x426A0260UL))
#define bM0P_WSUNIT_BUR01_BUR010                        *((volatile unsigned int*)(0x426AE000UL))
#define bM0P_WSUNIT_BUR01_BUR011                        *((volatile unsigned int*)(0x426AE004UL))
#define bM0P_WSUNIT_BUR01_BUR012                        *((volatile unsigned int*)(0x426AE008UL))
#define bM0P_WSUNIT_BUR01_BUR013                        *((volatile unsigned int*)(0x426AE00CUL))
#define bM0P_WSUNIT_BUR01_BUR014                        *((volatile unsigned int*)(0x426AE010UL))
#define bM0P_WSUNIT_BUR01_BUR015                        *((volatile unsigned int*)(0x426AE014UL))
#define bM0P_WSUNIT_BUR01_BUR016                        *((volatile unsigned int*)(0x426AE018UL))
#define bM0P_WSUNIT_BUR01_BUR017                        *((volatile unsigned int*)(0x426AE01CUL))
#define bM0P_WSUNIT_BUR02_BUR020                        *((volatile unsigned int*)(0x426AE020UL))
#define bM0P_WSUNIT_BUR02_BUR021                        *((volatile unsigned int*)(0x426AE024UL))
#define bM0P_WSUNIT_BUR02_BUR022                        *((volatile unsigned int*)(0x426AE028UL))
#define bM0P_WSUNIT_BUR02_BUR023                        *((volatile unsigned int*)(0x426AE02CUL))
#define bM0P_WSUNIT_BUR02_BUR024                        *((volatile unsigned int*)(0x426AE030UL))
#define bM0P_WSUNIT_BUR02_BUR025                        *((volatile unsigned int*)(0x426AE034UL))
#define bM0P_WSUNIT_BUR02_BUR026                        *((volatile unsigned int*)(0x426AE038UL))
#define bM0P_WSUNIT_BUR02_BUR027                        *((volatile unsigned int*)(0x426AE03CUL))
#define bM0P_WSUNIT_BUR03_BUR030                        *((volatile unsigned int*)(0x426AE040UL))
#define bM0P_WSUNIT_BUR03_BUR031                        *((volatile unsigned int*)(0x426AE044UL))
#define bM0P_WSUNIT_BUR03_BUR032                        *((volatile unsigned int*)(0x426AE048UL))
#define bM0P_WSUNIT_BUR03_BUR033                        *((volatile unsigned int*)(0x426AE04CUL))
#define bM0P_WSUNIT_BUR03_BUR034                        *((volatile unsigned int*)(0x426AE050UL))
#define bM0P_WSUNIT_BUR03_BUR035                        *((volatile unsigned int*)(0x426AE054UL))
#define bM0P_WSUNIT_BUR03_BUR036                        *((volatile unsigned int*)(0x426AE058UL))
#define bM0P_WSUNIT_BUR03_BUR037                        *((volatile unsigned int*)(0x426AE05CUL))
#define bM0P_WSUNIT_BUR04_BUR040                        *((volatile unsigned int*)(0x426AE060UL))
#define bM0P_WSUNIT_BUR04_BUR041                        *((volatile unsigned int*)(0x426AE064UL))
#define bM0P_WSUNIT_BUR04_BUR042                        *((volatile unsigned int*)(0x426AE068UL))
#define bM0P_WSUNIT_BUR04_BUR043                        *((volatile unsigned int*)(0x426AE06CUL))
#define bM0P_WSUNIT_BUR04_BUR044                        *((volatile unsigned int*)(0x426AE070UL))
